app/controllers/gifs_controller.rb

SELECT "gifs".* FROM "gifs"
---
  def index
    @gifs = Gif.all

SELECT "gifs".* FROM "gifs" WHERE "gifs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @gif = Gif.find(params[:id])

INSERT INTO "gifs" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Guatemala"], ["created_at", "2020-03-16 14:44:12.815919"], ["updated_at", "2020-03-16 14:44:12.815919"]]
---
  def create
    @gif = Gif.new(gif_params)
    if @gif.save